#+BEGIN_COMMENT
.. title: The Tweet Vectorizer
.. slug: the-tweet-vectorizer
.. date: 2020-07-24 16:51:53 UTC-07:00
.. tags: twitter,nlp
.. category: NLP
.. link: 
.. description: Transforming Tweets into count vectors.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 2
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-9a4aeb7b-e200-4c23-b9f5-244f9fc113c9.json

#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
** Plotting The Vectors
   Now that we have a vectorizer, let's see what it looks like when we plot the training set.

#+begin_src python :results output :exports both
sentiment = {
    0: "Negative",
    1:"Positive"
}
data.loc[:, "sentiment"] = data.sentiment.map(sentiment)

print(data.sentiment.value_counts())

#+end_src

#+RESULTS:
: Positive    4000
: Negative    4000
: Name: sentiment, dtype: int64

If you followed the previous post you can probably figure out that this is the training set.

*** The Weights
    Since I saved the weights for our Logistic Regression model we can load it now

#+begin_src python :results output :exports both
weights_path = Path(os.environ["TWITTER_REGRESSION_WEIGHTS"]).expanduser()
assert weights_path.is_file()
theta = pandas.read_csv(weights_path)
print(theta)

# 'weights' is just something to make it easier to remember which column is which
Weights = Namespace(
    bias=0,
    positive=1,
    negative=2
)
#+end_src

#+RESULTS:
:            bias  positive  negative
: 0  6.369479e-08  0.000537 -0.000558



